PROBLEM: Employee satisfaction bisa berpengaruh terhadap kinerja kerja dan akan berdampak terhadap KPI dalam perusahaan
oleh karena itu, dalam project ini, saya ingin melihat apa saja yang dapat dilakukan oleh HR dalam hiring agar kecenderungan staff yang akan direkrut adalah staff yang akan memiliki tingkat kepuasan kerja tinggi di dalam perusahaan tersebut

PROJECT: project ini akan dilakukan untuk memprediksi faktor apa saja yang membuat seorang staff puas bekerja di perusahaan tsb.

Python Packages

In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [19]:
df = pd.read_csv('satisfaction.csv',index_col=0)

In [20]:
df.head()

,emp_id,age,Dept,location,education,recruitment_type,job_level,rating,onsite,awards,certifications,salary,satisfied
0,HR8270,28,HR,Suburb,PG,Referral,5,2,0,1,0,86750,1
1,TECH1860,50,Technology,Suburb,PG,Walk-in,3,5,1,2,1,42419,0
2,TECH6390,43,Technology,Suburb,UG,Referral,4,1,0,2,0,65715,0
3,SAL6191,44,Sales,City,PG,On-Campus,2,3,1,0,0,29805,1
4,HR6734,33,HR,City,UG,Recruitment Agency,2,1,0,5,0,29805,1

TO DROP, NOR NOT TO DROP

emp_id saya drop dikarenakan index sudah menggunakan kolom 0 dan emp_id hanya merupakan kode unik setiap staff.

In [21]:
df.drop(columns=['emp_id'],inplace=True)

dari file sebelumnya, saya melihat bahwa Job Level dan Gaji memiliki kecenderungan yang sama, dengan 5 unique value
oleh karena itu, saya akan melakukan drop terhadap salary, dikarenakan salary seragam pada setiap job levelnya.

In [22]:
df['salary'].value_counts()

65715    110
29805    110
86750    103
24076     95
42419     82
Name: salary, dtype: int64

In [23]:
df['job_level'].value_counts()

4    110
2    110
5    103
1     95
3     82
Name: job_level, dtype: int64

In [24]:
df.drop(columns=['salary'],inplace=True)

mengingat apabila masuk ke dalam perusahaan dan telah bekerja disana, terkadang jalur masuk bukan lagi jadi peranan penting karena dari semua jalur masuk, tujuannya adalah diterima kerja..
apabila staff sudah diterima kerja, dugaan saya adalah jalur masuk tidak lagi jadi peranan penting dalam kepuasan individu yang bekerja di dalam perusahaan tsb

In [25]:
df.drop(columns=['recruitment_type'],inplace=True)

STRING TO NUMERICAL CONVERSION

agar model dapat membaca dataframe, maka ada beberapa value yang harus diubah ke float/int
berikut adalah list note agar tidak tertukar

DEPT    HR                      : 0
        Technology              : 1
        Sales                   : 2
        Purchasing              : 3
        Marketing               : 4
location     Suburb             : 0
            City                : 1
education   UG                  : 0
            PG                  : 1

In [26]:
df['Dept']=df['Dept'].map({'HR':0,'Technology':1,'Sales':2,'Purchasing':3,'Marketing':4})
df['location']=df['location'].map({'Suburb':0,'City':1})
df['education']=df['education'].map({'UG':0,'PG':1})

In [27]:
df

,age,Dept,location,education,job_level,rating,onsite,awards,certifications,satisfied
0,28,0,0,1,5,2,0,1,0,1
1,50,1,0,1,3,5,1,2,1,0
2,43,1,0,0,4,1,0,2,0,0
3,44,2,1,1,2,3,1,0,0,1
4,33,0,1,0,2,1,0,5,0,1
...,...,...,...,...,...,...,...,...,...,...
495,49,0,0,1,2,5,0,6,0,1
496,24,1,0,0,2,4,0,2,0,0
497,34,4,1,1,1,3,0,2,0,1
498,26,1,1,0,2,1,1,1,1,0
499,26,1,1,0,3,4,0,3,0,0

In [28]:
df

,age,Dept,location,education,job_level,rating,onsite,awards,certifications,satisfied
0,28,0,0,1,5,2,0,1,0,1
1,50,1,0,1,3,5,1,2,1,0
2,43,1,0,0,4,1,0,2,0,0
3,44,2,1,1,2,3,1,0,0,1
4,33,0,1,0,2,1,0,5,0,1
...,...,...,...,...,...,...,...,...,...,...
495,49,0,0,1,2,5,0,6,0,1
496,24,1,0,0,2,4,0,2,0,0
497,34,4,1,1,1,3,0,2,0,1
498,26,1,1,0,2,1,1,1,1,0
499,26,1,1,0,3,4,0,3,0,0

In [29]:
df.dtypes

age               int64
Dept              int64
location          int64
education         int64
job_level         int64
rating            int64
onsite            int64
awards            int64
certifications    int64
satisfied         int64
dtype: object

In [30]:
df.to_csv('converted.csv')